In [1]:
import pandas as pd
import numpy as np

pd.set_option("max.colwidth", None)

In [2]:
df = pd.read_excel("../5.-Jumbled-up-Customers-Details.xlsx", header=None)

In [3]:
df.head()

                                                                                        0
0  Name Hussein Hakeem Address Number 22 Fioye Crescent Surulere Lagos Age 17 Gender Male
1      Name Arojoye Samuel Address 11 Omolade Close Omole Estate Lagos Age 16 Gender Male
2                         Name Alex Ezurum Address 1 Adamu Lane, Abuja Age 14 Gender Male
3     Name Susan Nwaimo Address Number 58 Yaba Street, Kaduna State  Age 16 Gender Female
4           Name Ajao Opeyemi Address No12 Olubunmi Street, Abeokuta Age 18 Gender Female

In [4]:
splitted_df = df[0].str.split(" ")

In [5]:
splitted_df.head(10)

0    [Name, Hussein, Hakeem, Address, Number, 22, Fioye, Crescent, Surulere, Lagos, Age, 17, Gender, Male]
1        [Name, Arojoye, Samuel, Address, 11, Omolade, Close, Omole, Estate, Lagos, Age, 16, Gender, Male]
2                             [Name, Alex, Ezurum, Address, 1, Adamu, Lane,, Abuja, Age, 14, Gender, Male]
3      [Name, Susan, Nwaimo, Address, Number, 58, Yaba, Street,, Kaduna, State, , Age, 16, Gender, Female]
4               [Name, Ajao, Opeyemi, Address, No12, Olubunmi, Street,, Abeokuta, Age, 18, Gender, Female]
5         [Name, Banjoko, Adebusola, Address, 34, Ngige, Street,, Ugheli,, Delta, Age, 14, Gender, Female]
6                     [Name, Muhammed, Olabisi, Address, 13,, ICAN, road,, Enugu, Age, 12, Gender, Female]
7                     [Name, Oluwagbemi, Mojisola, Address, ACCA, Lane,, Onitsha, Age, 13, Gender, Female]
Name: 0, dtype: object

In [6]:
splitted_df.info()

<class 'pandas.core.series.Series'>
RangeIndex: 8 entries, 0 to 7
Series name: 0
Non-Null Count  Dtype
--------------  -----
8 non-null      object
dtypes: object(1)
memory usage: 196.0+ bytes

In [22]:
rows = []

for i in splitted_df:
    idx_name = i.index("Name")
    idx_addr = i.index("Address")
    idx_age = i.index("Age")
    idx_gdr = i.index("Gender")
    # print(" ".join(i[idx_name+1: idx_addr])) 
    # new_df["name"] = " ".join(i[idx_name+1: idx_addr])
    # new_df["address"] = " ".join(i[idx_addr+1: idx_age])
    # new_df["age"] = i[idx_age+1]
    # new_df["gender"] = i[idx_gdr+1]

    new_row = {
        "name": " ".join(i[idx_name+1: idx_addr]),
        "address": " ".join(i[idx_addr+1: idx_age]),
        "age": i[idx_age+1],
        "gender": i[idx_gdr+1]
    }

    rows.append(new_row)

new_df = pd.DataFrame(rows)

In [23]:
new_df.head(10)

                  name                                  address age  gender
0       Hussein Hakeem  Number 22 Fioye Crescent Surulere Lagos  17    Male
1       Arojoye Samuel      11 Omolade Close Omole Estate Lagos  16    Male
2          Alex Ezurum                      1 Adamu Lane, Abuja  14    Male
3         Susan Nwaimo     Number 58 Yaba Street, Kaduna State   16  Female
4         Ajao Opeyemi           No12 Olubunmi Street, Abeokuta  18  Female
5    Banjoko Adebusola           34 Ngige Street, Ugheli, Delta  14  Female
6     Muhammed Olabisi                     13, ICAN road, Enugu  12  Female
7  Oluwagbemi Mojisola                       ACCA Lane, Onitsha  13  Female